In [1]:
import requests
import pandas as pd
# from datetime import datetime

In [2]:

# Toronto Open Data is stored in a CKAN instance. It's APIs are documented here:
# https://docs.ckan.org/en/latest/api/

# To hit our API, you'll be making requests to:
base_url = "https://ckan0.cf.opendata.inter.prod-toronto.ca"

# Datasets are called "packages". Each package can contain many "resources"
# To retrieve the metadata for this package and its resources, use the package name in this page's URL:
url = base_url + "/api/3/action/package_show"
params = {"id": "licensed-dog-and-cat-names"}
package = requests.get(url, params = params).json()

In [3]:
f'Package success: {package["success"]}'

'Package success: True'

In [4]:
print(f'Number of resources: {package["result"]["num_resources"]}\n')
for idx, resource in enumerate(package["result"]["resources"]):
    # print(resource)
    print(f'{idx}: {resource["name"]}\n**Active: {resource["datastore_active"]}\n')

Number of resources: 22

0: licensed-names-for-dogs-2012
**Active: False

1: licensed-names-for-cats-2012
**Active: False

2: licensed-names-for-dogs-2013
**Active: False

3: licensed-names-for-cats-2013
**Active: False

4: licensed-names-for-dogs-2014
**Active: False

5: licensed-names-for-cats-2014
**Active: False

6: licensed-names-for-dogs-2015
**Active: False

7: licensed-names-for-cats-2015
**Active: False

8: licensed-names-for-dogs-2016
**Active: False

9: licensed-names-for-cats-2016
**Active: False

10: licensed-names-for-dogs-2017
**Active: False

11: licensed-names-for-cats-2017
**Active: False

12: licensed-names-for-dogs-2018
**Active: False

13: licensed-names-for-cats-2018
**Active: False

14: licensed-names-for-dogs-2019
**Active: False

15: licensed-names-for-cats-2019
**Active: False

16: licensed-names-for-dog-2020
**Active: False

17: licensed-names-for-cats-2020
**Active: False

18: licensed-names-for-dogs-2021
**Active: False

19: licensed-names-for-cats-2021
**Active: False

20: licensed-names-for-dogs-2022
**Active: False

21: licensed-names-for-cats-2022
**Active: False

In [5]:
# create df to store result
df = pd.DataFrame(columns=['name', 'count'])
# list of names that will be changed to 'NO NAME'
no_name_values = ['', 'N/A', 'NO NAME LISTED']

# To get resource data:
for idx, resource in enumerate(package["result"]["resources"]):
    # To get data from files:
    if not resource["datastore_active"]:
        print(f'**getting data from url**')
        print(f'\t{resource["url"]}')
        # read data to temporary df
        tmp_df = pd.read_excel(
            resource["url"],
            header=None,
            names=['name', 'count'],
            converters={
                'name': lambda x: 'NO NAME' if x in no_name_values else x,
                'count': lambda x: 0 if x == '' else x
            }
        )
        # get rid of empty rows by dropping those with count 0
        tmp_df = tmp_df.loc[tmp_df['count']>0]
        # get name of resource and extract year and species from it
        title = resource['name'].strip('\t').split('-')
        tmp_df['year'] = title[-1]
        tmp_df['species'] = title[-2].strip('s')

        print(tmp_df.head())
        # append to result df
        df = df._append(tmp_df, ignore_index=True)

# if columns dont display completely
# pd.set_option('display.max_columns', None)

df.head()

**getting data from url**
	https://ckan0.cf.opendata.inter.prod-toronto.ca/dataset/37b2915c-f291-4b0e-bdd4-d6ccb070119a/resource/d57249a8-a7df-4974-9bdb-08c58a3b1b18/download/licensed-names-for-dogs-2012.xls
      name  count  year species
1  CHARLIE    674  2012     dog
2      MAX    660  2012     dog
3    BUDDY    534  2012     dog
4    MOLLY    506  2012     dog
5    BELLA    489  2012     dog
**getting data from url**
	https://ckan0.cf.opendata.inter.prod-toronto.ca/dataset/37b2915c-f291-4b0e-bdd4-d6ccb070119a/resource/04b1765c-c509-473b-8fa9-9642db9d7fec/download/licensed-names-for-cats-2012.xls
      name  count  year species
1  NO NAME    658  2012     cat
2      MAX    198  2012     cat
3    TIGER    183  2012     cat
4  CHARLIE    181  2012     cat
5   SMOKEY    178  2012     cat
**getting data from url**
	https://ckan0.cf.opendata.inter.prod-toronto.ca/dataset/37b2915c-f291-4b0e-bdd4-d6ccb070119a/resource/158c165b-6a58-4090-84e0-b802c9206c1e/download/licensed-names-for-dogs-2013.xls
      name  count  year species
1  CHARLIE    656  2013     dog
2      MAX    605  2013     dog
3    BUDDY    523  2013     dog
4    BELLA    482  2013     dog
5    MOLLY    481  2013     dog
**getting data from url**
	https://ckan0.cf.opendata.inter.prod-toronto.ca/dataset/37b2915c-f291-4b0e-bdd4-d6ccb070119a/resource/10f65e3e-f751-4f29-b4ca-7b949a5378d2/download/licensed-names-for-cats-2013.xls
      name  count  year species
1  NO NAME    745  2013     cat
2  CHARLIE    190  2013     cat
3      MAX    175  2013     cat
4   SMOKEY    161  2013     cat
5    TIGER    161  2013     cat
**getting data from url**
	https://ckan0.cf.opendata.inter.prod-toronto.ca/dataset/37b2915c-f291-4b0e-bdd4-d6ccb070119a/resource/47c1f092-aa1c-4c9d-b562-14a3bfcda21e/download/licensed-names-for-dogs-2014.xls
      name  count  year species
1  CHARLIE    661  2014     dog
2      MAX    585  2014     dog
3    BELLA    523  2014     dog
4    BUDDY    511  2014     dog
5    MOLLY    481  2014     dog
**getting data from url**
	https://ckan0.cf.opendata.inter.prod-toronto.ca/dataset/37b2915c-f291-4b0e-bdd4-d6ccb070119a/resource/6b2850ec-0ef5-487a-ae61-89784f903004/download/licensed-names-for-cats-2014.xls
      name  count  year species
1  NO NAME    679  2014     cat
2  CHARLIE    182  2014     cat
3      MAX    163  2014     cat
4    MOLLY    156  2014     cat
5   SMOKEY    155  2014     cat
**getting data from url**
	https://ckan0.cf.opendata.inter.prod-toronto.ca/dataset/37b2915c-f291-4b0e-bdd4-d6ccb070119a/resource/951c36e4-955b-4e93-ad31-cd4850785e90/download/licensed-names-for-dogs-2015.xls
      name  count  year species
2  CHARLIE    678  2015     dog
3      MAX    560  2015     dog
4    BELLA    515  2015     dog
5    BUDDY    480  2015     dog
6    MOLLY    463  2015     dog
**getting data from url**
	https://ckan0.cf.opendata.inter.prod-toronto.ca/dataset/37b2915c-f291-4b0e-bdd4-d6ccb070119a/resource/b66bc321-5df3-465f-8053-e83499a180eb/download/licensed-names-for-cats-2015.xls
      name  count  year species
2  NO NAME    833  2015     cat
3  CHARLIE    174  2015     cat
4      MAX    157  2015     cat
5    MOLLY    150  2015     cat
6    TIGER    140  2015     cat
**getting data from url**
	https://ckan0.cf.opendata.inter.prod-toronto.ca/dataset/37b2915c-f291-4b0e-bdd4-d6ccb070119a/resource/d0ca61a8-3496-4e5b-b04e-e8e6669b8ffd/download/licensed-names-for-dogs-2016.xls
      name  count  year species
1  CHARLIE    721  2016     dog
2    BELLA    542  2016     dog
3      MAX    533  2016     dog
4    MOLLY    456  2016     dog
5    BUDDY    440  2016     dog
**getting data from url**
	https://ckan0.cf.opendata.inter.prod-toronto.ca/dataset/37b2915c-f291-4b0e-bdd4-d6ccb070119a/resource/60936e31-9f7a-4b50-9b86-05d14e94769f/download/licensed-names-for-cats-2016.xls
      name  count  year species
1  NO NAME    611  2016     cat
2  CHARLIE    155  2016     cat
3    MOLLY    155  2016     cat
4      MAX    144  2016     cat
5    BELLA    132  2016     cat
**getting data from url**
	https://ckan0.cf.opendata.inter.prod-toronto.ca/dataset/37b2915c-f291-4b0e-bdd4-d6ccb070119a/resource/cff9c7d2-d305-4fc2-a27e-fa1c37e2d3b6/download/licensed-names-for-dogs-2017.xls
      name  count  year species
2  CHARLIE    728  2017     dog
3    BELLA    558  2017     dog
4      MAX    519  2017     dog
5    MOLLY    444  2017     dog
6    BUDDY    424  2017     dog
**getting data from url**
	https://ckan0.cf.opendata.inter.prod-toronto.ca/dataset/37b2915c-f291-4b0e-bdd4-d6ccb070119a/resource/3ad23cb1-cc8b-4ad0-a232-ad7256568af4/download/licensed-names-for-cats-2017.xls
      name  count  year species
2  NO NAME    560  2017     cat
3  CHARLIE    165  2017     cat
4    MOLLY    142  2017     cat
5    BELLA    133  2017     cat
6      MAX    131  2017     cat
**getting data from url**
	https://ckan0.cf.opendata.inter.prod-toronto.ca/dataset/37b2915c-f291-4b0e-bdd4-d6ccb070119a/resource/421b01d7-03d3-4973-95ca-587f8a8549f8/download/2018-licenced-dog-names.xls
      name  count  year species
1  CHARLIE    678  2018     dog
2    BELLA    538  2018     dog
3      MAX    470  2018     dog
4    MOLLY    419  2018     dog
5    BUDDY    396  2018     dog
**getting data from url**
	https://ckan0.cf.opendata.inter.prod-toronto.ca/dataset/37b2915c-f291-4b0e-bdd4-d6ccb070119a/resource/55cf54d5-e4af-485c-ab59-dddb832e5b38/download/2018-licenced-cat-names.xls
      name  count  year species
1  NO NAME    483  2018     cat
2  CHARLIE    145  2018     cat
3    BELLA    138  2018     cat
4    MOLLY    134  2018     cat
5     LUNA    130  2018     cat
**getting data from url**
	https://ckan0.cf.opendata.inter.prod-toronto.ca/dataset/37b2915c-f291-4b0e-bdd4-d6ccb070119a/resource/0720b700-c463-4885-aac5-d76c571f398a/download/2019-licenced-dog-names.xls
      name  count  year species
1  CHARLIE    639  2019     dog
2    BELLA    486  2019     dog
3      MAX    423  2019     dog
4     LUNA    393  2019     dog
5    MOLLY    368  2019     dog
**getting data from url**
	https://ckan0.cf.opendata.inter.prod-toronto.ca/dataset/37b2915c-f291-4b0e-bdd4-d6ccb070119a/resource/1cafd540-6209-48a0-8167-f43ade6911c3/download/2019-licenced-cat-names.xls
      name  count  year species
1  NO NAME    427  2019     cat
2  CHARLIE    129  2019     cat
3    BELLA    128  2019     cat
4     LUNA    125  2019     cat
5     LUCY    106  2019     cat
**getting data from url**
	https://ckan0.cf.opendata.inter.prod-toronto.ca/dataset/37b2915c-f291-4b0e-bdd4-d6ccb070119a/resource/891bffcd-d4cd-4aa6-a64b-b7387fb6c020/download/2020-licenced-dog-names.xls
      name  count  year species
1  CHARLIE    561  2020     dog
2     LUNA    423  2020     dog
3    BELLA    420  2020     dog
4      MAX    352  2020     dog
5     COCO    311  2020     dog
**getting data from url**
	https://ckan0.cf.opendata.inter.prod-toronto.ca/dataset/37b2915c-f291-4b0e-bdd4-d6ccb070119a/resource/537bc1c1-65b3-430e-8656-9f4c4c354fd7/download/2020-licenced-cat-names.xls
      name  count  year species
1  NO NAME    279  2020     cat
2  CHARLIE    123  2020     cat
3     LUNA    121  2020     cat
4    BELLA     96  2020     cat
5     LUCY     82  2020     cat
**getting data from url**
	https://ckan0.cf.opendata.inter.prod-toronto.ca/dataset/37b2915c-f291-4b0e-bdd4-d6ccb070119a/resource/e363b41b-7242-4c85-866d-cf6c0e5f7ff0/download/2021-licenced-dog-names.xls
      name  count  year species
1  CHARLIE    617  2021     dog
2     LUNA    503  2021     dog
3    BELLA    475  2021     dog
4      MAX    394  2021     dog
5     COCO    353  2021     dog
**getting data from url**
	https://ckan0.cf.opendata.inter.prod-toronto.ca/dataset/37b2915c-f291-4b0e-bdd4-d6ccb070119a/resource/4e50bbe6-1e6c-4a02-bb1b-66b3d166ebca/download/2021-licenced-cat-names.xls
      name  count  year species
1  NO NAME    286  2021     cat
2     LUNA    150  2021     cat
3  CHARLIE    127  2021     cat
4    BELLA    101  2021     cat
5   SHADOW    101  2021     cat
**getting data from url**
	https://ckan0.cf.opendata.inter.prod-toronto.ca/dataset/37b2915c-f291-4b0e-bdd4-d6ccb070119a/resource/6a214cd3-a696-4e5c-a91a-e3ae34ab5964/download/2022-licenced-dog-names.xls
      name  count  year species
1  CHARLIE    557  2022     dog
2     LUNA    505  2022     dog
3    BELLA    409  2022     dog
4      MAX    355  2022     dog
5     COCO    334  2022     dog
**getting data from url**
	https://ckan0.cf.opendata.inter.prod-toronto.ca/dataset/37b2915c-f291-4b0e-bdd4-d6ccb070119a/resource/582648c2-1ca8-4554-8035-67ded8e3e787/download/2022-licenced-cat-names.xls
      name  count  year species
1  NO NAME    243  2022     cat
2     LUNA    143  2022     cat
3  CHARLIE    116  2022     cat
4    BELLA     85  2022     cat
5   SHADOW     85  2022     cat

      name count  year species
0  CHARLIE   674  2012     dog
1      MAX   660  2012     dog
2    BUDDY   534  2012     dog
3    MOLLY   506  2012     dog
4    BELLA   489  2012     dog

In [6]:
df['count'] = df['count'].astype('Int64')
df = df.groupby(['year', 'species', 'name'], as_index=False).sum()
df.sort_values(
    by=['year', 'species', 'count'],
    ascending=[True, False, False],
    inplace=True, ignore_index=True
)
df.head()

   year species     name  count
0  2012     dog  CHARLIE    674
1  2012     dog      MAX    660
2  2012     dog    BUDDY    534
3  2012     dog    MOLLY    506
4  2012     dog    BELLA    489

In [7]:
# assign rank based on count within year and species
df['rank'] = (df
    .drop(columns='name')
    .groupby(['year', 'species'])
    .rank(method='min', ascending=False)
)
df.head()

   year species     name  count  rank
0  2012     dog  CHARLIE    674   1.0
1  2012     dog      MAX    660   2.0
2  2012     dog    BUDDY    534   3.0
3  2012     dog    MOLLY    506   4.0
4  2012     dog    BELLA    489   5.0

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 201615 entries, 0 to 201614
Data columns (total 5 columns):
 #   Column   Non-Null Count   Dtype
---  ------   --------------   -----
 0   year     201615 non-null  object
 1   species  201615 non-null  object
 2   name     201615 non-null  object
 3   count    201615 non-null  Int64
 4   rank     201615 non-null  Float64
dtypes: Float64(1), Int64(1), object(3)
memory usage: 8.1+ MB

In [9]:
df['year'].unique()

array(['2012', '2013', '2014', '2015', '2016', '2017', '2018', '2019',
       '2020', '2021', '2022'], dtype=object)

In [10]:
df['species'].unique()

array(['dog', 'cat'], dtype=object)

In [11]:
# Update saved csv
df.to_csv(
    'Licensed_pets.csv',
    header=True,
    index=False
)